rscinto/BMM150_STM32_F446RE/bmm150.cpp
#include "bmm150.h"
#include "stm32f4xx_hal.h"



BMM150::BMM150() {
}

int8_t BMM150::initialize(I2C_HandleTypeDef* hi2c1) {

    /* Power up the sensor from suspend to sleep mode */
    set_op_mode(BMM150_SLEEP_MODE, hi2c1);
    HAL_Delay(BMM150_START_UP_TIME);

    /* Check chip ID */
    uint8_t id = i2c_read(BMM150_CHIP_ID_ADDR, hi2c1);
    if (id != BMM150_CHIP_ID) {
        return BMM150_E_ID_NOT_CONFORM;
    }

    /* Function to update trim values */
    read_trim_registers(hi2c1);

    /* Setting the power mode as normal */
    set_op_mode(BMM150_NORMAL_MODE, hi2c1);

    /*  Setting the preset mode as Low power mode
        i.e. data rate = 10Hz XY-rep = 1 Z-rep = 2*/
    //set_presetmode(BMM150_PRESETMODE_LOWPOWER, hi2c1);


    return BMM150_OK;
}

void BMM150::read_mag_data(I2C_HandleTypeDef* hi2c1) {

	int8_t reg_dataX_LSB = 0;
	int8_t reg_dataX_MSB = 0;

	int8_t reg_dataY_LSB = 0;
	int8_t reg_dataY_MSB = 0;

	int8_t reg_dataZ_LSB = 0;
	int8_t reg_dataZ_MSB = 0;

    i2c_read(BMM150_DATA_X_LSB, &reg_dataX_LSB, 1, hi2c1);
    i2c_read(BMM150_DATA_X_MSB, &reg_dataX_MSB, 1, hi2c1);

    i2c_read(BMM150_DATA_Y_LSB, &reg_dataY_LSB, 1, hi2c1);
    i2c_read(BMM150_DATA_Y_MSB, &reg_dataY_MSB, 1, hi2c1);

    i2c_read(BMM150_DATA_Z_LSB, &reg_dataZ_LSB, 1, hi2c1);
    i2c_read(BMM150_DATA_Z_MSB, &reg_dataZ_MSB, 1, hi2c1);

    int16_t reg_dataX_MSB_wider = reg_dataX_MSB << 5;
    raw_mag_data.raw_datax = (int16_t)(reg_dataX_MSB_wider | reg_dataX_LSB);

    int16_t reg_dataY_MSB_wider = reg_dataY_MSB << 5;
    raw_mag_data.raw_datay = (int16_t)(reg_dataY_MSB_wider | reg_dataY_LSB);

    int16_t reg_dataZ_MSB_wider = reg_dataZ_MSB << 5;
    raw_mag_data.raw_dataz = (int16_t)(reg_dataZ_MSB_wider | reg_dataZ_LSB);




//    /* Mag X axis data */
//    reg_data[0] = BMM150_GET_BITS(reg_data[0], BMM150_DATA_X);
//    /* Shift the MSB data to left by 5 bits */
//    /* Multiply by 32 to get the shift left by 5 value */
//    msb_data = ((int16_t)((int8_t)reg_data[1])) * 32;
//    /* Raw mag X axis data */
//    raw_mag_data.raw_datax = (int16_t)(msb_data | reg_data[0]);
//    /* Mag Y axis data */
//    reg_data[2] = BMM150_GET_BITS(reg_data[2], BMM150_DATA_Y);
//    /* Shift the MSB data to left by 5 bits */
//    /* Multiply by 32 to get the shift left by 5 value */
//    msb_data = ((int16_t)((int8_t)reg_data[3])) * 32;
//    /* Raw mag Y axis data */
//    raw_mag_data.raw_datay = (int16_t)(msb_data | reg_data[2]);
//    /* Mag Z axis data */
//    reg_data[4] = BMM150_GET_BITS(reg_data[4], BMM150_DATA_Z);
//    /* Shift the MSB data to left by 7 bits */
//    /* Multiply by 128 to get the shift left by 7 value */
//    msb_data = ((int16_t)((int8_t)reg_data[5])) * 128;
//    /* Raw mag Z axis data */
//    raw_mag_data.raw_dataz = (int16_t)(msb_data | reg_data[4]);

//    /* Mag R-HALL data */
//    reg_data[6] = BMM150_GET_BITS(reg_data[6], BMM150_DATA_RHALL);
//    raw_mag_data.raw_data_r = (uint16_t)(((uint16_t)reg_data[7] << 6) | reg_data[6]);
//
//    /* Compensated Mag X data in int16_t format */
//    mag_data.x = compensate_x(raw_mag_data.raw_datax, raw_mag_data.raw_data_r);
//    /* Compensated Mag Y data in int16_t format */
//    mag_data.y = compensate_y(raw_mag_data.raw_datay, raw_mag_data.raw_data_r);
//    /* Compensated Mag Z data in int16_t format */
//    mag_data.z = compensate_z(raw_mag_data.raw_dataz, raw_mag_data.raw_data_r);
}

/*
    @brief This internal API is used to obtain the compensated
    magnetometer X axis data(micro-tesla) in int16_t.
*/
int16_t BMM150::compensate_x(int16_t mag_data_x, uint16_t data_rhall) {
    int16_t retval;
    uint16_t process_comp_x0 = 0;
    int32_t process_comp_x1;
    uint16_t process_comp_x2;
    int32_t process_comp_x3;
    int32_t process_comp_x4;
    int32_t process_comp_x5;
    int32_t process_comp_x6;
    int32_t process_comp_x7;
    int32_t process_comp_x8;
    int32_t process_comp_x9;
    int32_t process_comp_x10;

    /* Overflow condition check */
    if (mag_data_x != BMM150_XYAXES_FLIP_OVERFLOW_ADCVAL) {
        if (data_rhall != 0) {
            /* Availability of valid data*/
            process_comp_x0 = data_rhall;
        } else if (trim_data.dig_xyz1 != 0) {
            process_comp_x0 = trim_data.dig_xyz1;
        } else {
            process_comp_x0 = 0;
        }
        if (process_comp_x0 != 0) {
            /* Processing compensation equations*/
            process_comp_x1 = ((int32_t)trim_data.dig_xyz1) * 16384;
            process_comp_x2 = ((uint16_t)(process_comp_x1 / process_comp_x0)) - ((uint16_t)0x4000);
            retval = ((int16_t)process_comp_x2);
            process_comp_x3 = (((int32_t)retval) * ((int32_t)retval));
            process_comp_x4 = (((int32_t)trim_data.dig_xy2) * (process_comp_x3 / 128));
            process_comp_x5 = (int32_t)(((int16_t)trim_data.dig_xy1) * 128);
            process_comp_x6 = ((int32_t)retval) * process_comp_x5;
            process_comp_x7 = (((process_comp_x4 + process_comp_x6) / 512) + ((int32_t)0x100000));
            process_comp_x8 = ((int32_t)(((int16_t)trim_data.dig_x2) + ((int16_t)0xA0)));
            process_comp_x9 = ((process_comp_x7 * process_comp_x8) / 4096);
            process_comp_x10 = ((int32_t)mag_data_x) * process_comp_x9;
            retval = ((int16_t)(process_comp_x10 / 8192));
            retval = (retval + (((int16_t)trim_data.dig_x1) * 8)) / 16;
        } else {
            retval = BMM150_OVERFLOW_OUTPUT;
        }
    } else {
        /* Overflow condition */
        retval = BMM150_OVERFLOW_OUTPUT;
    }

    return retval;
}

/*
    @brief This internal API is used to obtain the compensated
    magnetometer Y axis data(micro-tesla) in int16_t.
*/
int16_t BMM150::compensate_y(int16_t mag_data_y, uint16_t data_rhall) {
    int16_t retval;
    uint16_t process_comp_y0 = 0;
    int32_t process_comp_y1;
    uint16_t process_comp_y2;
    int32_t process_comp_y3;
    int32_t process_comp_y4;
    int32_t process_comp_y5;
    int32_t process_comp_y6;
    int32_t process_comp_y7;
    int32_t process_comp_y8;
    int32_t process_comp_y9;

