rscinto/BMM150_STM32_F446RE/bmm150.cpp
}

void BMM150::i2c_read(short mem_address, uint8_t* buffer, short length, I2C_HandleTypeDef* hi2c1) {

	HAL_I2C_Mem_Read(hi2c1, (uint16_t)BMM150_I2C_Address<<1, mem_address, (uint16_t) length,(uint8_t*) buffer, (uint16_t)length, HAL_MAX_DELAY);

}


void BMM150::i2c_read(short mem_address, int8_t* buffer, short length, I2C_HandleTypeDef* hi2c1) {
	 HAL_I2C_Mem_Read(hi2c1, (uint16_t)BMM150_I2C_Address<<1, mem_address, (uint16_t) length, (uint8_t*) buffer, (uint16_t)length, HAL_MAX_DELAY);
}

uint8_t BMM150::i2c_read(uint16_t mem_address, I2C_HandleTypeDef* hi2c1) {
    uint8_t byte;
    HAL_I2C_Mem_Read(hi2c1, (uint16_t)BMM150_I2C_Address<<1, mem_address, (uint16_t) 1, (uint8_t *)&byte, (uint16_t)1, HAL_MAX_DELAY);

//    Wire.beginTransmission(BMM150_I2C_Address);
//    Wire.write(address);
//    Wire.endTransmission();
//    Wire.requestFrom(BMM150_I2C_Address, 1);
//    byte = Wire.read();
    return byte;
}


// char* BMM150::getErrorText(short errorCode);
// {
//     if(ERRORCODE_1_NUM == 1)
//     return ERRORCODE_1;

//     return "Error not defined.";
// }

void BMM150::set_op_mode(uint8_t pwr_mode, I2C_HandleTypeDef* hi2c1) {
    /* Select the power mode to set */
    switch (pwr_mode) {
        case BMM150_NORMAL_MODE:
            /*  If the sensor is in suspend mode
                put the device to sleep mode */
            suspend_to_sleep_mode(hi2c1);
            /* write the op mode */
            write_op_mode(pwr_mode,hi2c1);
            break;
        case BMM150_FORCED_MODE:
            /*  If the sensor is in suspend mode
                put the device to sleep mode */
            suspend_to_sleep_mode(hi2c1);
            /* write the op mode */
            write_op_mode(pwr_mode,hi2c1);
            break;
        case BMM150_SLEEP_MODE:
            /*  If the sensor is in suspend mode
                put the device to sleep mode */
            suspend_to_sleep_mode(hi2c1);
            /* write the op mode */
            write_op_mode(pwr_mode,hi2c1);
            break;
        case BMM150_SUSPEND_MODE:
            /* Set the power control bit to zero */
            set_power_control_bit(BMM150_POWER_CNTRL_DISABLE,hi2c1);
            break;
        default:
            break;
    }
}

void BMM150::suspend_to_sleep_mode(I2C_HandleTypeDef* hi2c1) {
    set_power_control_bit(BMM150_POWER_CNTRL_ENABLE, hi2c1);
    /* Start-up time delay of 3ms*/
    HAL_Delay(3);
}


void BMM150::read_trim_registers(I2C_HandleTypeDef* hi2c1) {
    uint8_t trim_x1y1[2] = {0};
    uint8_t trim_xyz_data[4] = {0};
    uint8_t trim_xy1xy2[10] = {0};
    uint16_t temp_msb = 0;

    /* Trim register value is read */
    i2c_read(BMM150_DIG_X1, trim_x1y1, 2, hi2c1);
    i2c_read(BMM150_DIG_Z4_LSB, trim_xyz_data, 4, hi2c1);
    i2c_read(BMM150_DIG_Z2_LSB, trim_xy1xy2, 10, hi2c1);
    /*  Trim data which is read is updated
        in the device structure */
    trim_data.dig_x1 = (int8_t)trim_x1y1[0];
    trim_data.dig_y1 = (int8_t)trim_x1y1[1];
    trim_data.dig_x2 = (int8_t)trim_xyz_data[2];
    trim_data.dig_y2 = (int8_t)trim_xyz_data[3];
    temp_msb = ((uint16_t)trim_xy1xy2[3]) << 8;
    trim_data.dig_z1 = (uint16_t)(temp_msb | trim_xy1xy2[2]);
    temp_msb = ((uint16_t)trim_xy1xy2[1]) << 8;
    trim_data.dig_z2 = (int16_t)(temp_msb | trim_xy1xy2[0]);
    temp_msb = ((uint16_t)trim_xy1xy2[7]) << 8;
    trim_data.dig_z3 = (int16_t)(temp_msb | trim_xy1xy2[6]);
    temp_msb = ((uint16_t)trim_xyz_data[1]) << 8;
    trim_data.dig_z4 = (int16_t)(temp_msb | trim_xyz_data[0]);
    trim_data.dig_xy1 = trim_xy1xy2[9];
    trim_data.dig_xy2 = (int8_t)trim_xy1xy2[8];
    temp_msb = ((uint16_t)(trim_xy1xy2[5] & 0x7F)) << 8;
    trim_data.dig_xyz1 = (uint16_t)(temp_msb | trim_xy1xy2[4]);

}

void BMM150::write_op_mode(uint8_t op_mode, I2C_HandleTypeDef* hi2c1) {
    uint8_t reg_data = 0;
    reg_data = i2c_read(BMM150_OP_MODE_ADDR, hi2c1);
    /* Set the op_mode value in Opmode bits of 0x4C */
    reg_data = BMM150_SET_BITS(reg_data, BMM150_OP_MODE, op_mode);

    i2c_write(BMM150_OP_MODE_ADDR, reg_data, hi2c1);
    //reg_data = i2c_read(BMM150_OP_MODE_ADDR, hi2c1);
}

void BMM150::set_power_control_bit(uint8_t pwrcntrl_bit, I2C_HandleTypeDef* hi2c1) {
    uint8_t reg_data = 0;
    /* Power control register 0x4B is read */
    reg_data = i2c_read(BMM150_POWER_CONTROL_ADDR, hi2c1);
    /* Sets the value of power control bit */
//    reg_data = BMM150_SET_BITS_POS_0(reg_data, BMM150_PWR_CNTRL, pwrcntrl_bit);
    reg_data = 1<<0;
    i2c_write(BMM150_POWER_CONTROL_ADDR, reg_data, hi2c1);
}







//DO NOT MESS WITH BELOW. As IS :)

// /*!
//  * @brief This API is used to perform the complete self test
//  * (both normal and advanced) for the BMM150 sensor
//  */
// int8_t BMM150::perform_self_test(uint8_t self_test_mode)
// {
// 	int8_t rslt;
// 	int8_t self_test_rslt = 0;

// 	switch (self_test_mode) {
// 	case BMM150_NORMAL_SELF_TEST:
// 		/* Set the sensor in sleep mode */
// 		settings.pwr_mode = BMM150_SLEEP_MODE;
// 		set_op_mode(BMM150_SLEEP_MODE);
// 		/* Perform the normal self test */
// 		rslt = perform_normal_self_test();
// 		break;

// 	case BMM150_ADVANCED_SELF_TEST:
// 		/* Perform the advanced self test */
// 		rslt = perform_adv_self_test();
// 		/* Check to ensure bus error does not occur */
// 		if (rslt >=  BMM150_OK) {
// 			/* Store the status of self test result */
// 			self_test_rslt = rslt;
// 			/* Perform soft reset */
// 			soft_reset();
// 		}
// 		rslt = self_test_rslt;
// 		break;
// 	default:
// 		rslt = BMM150_E_INVALID_CONFIG;
// 		break;
// 	}

// 	return rslt;
// }

// /*
//  * @brief This internal API is used to perform the normal self test
//  * of the sensor and return the self test result as return value
//  */
// int8_t BMM150::perform_normal_self_test()
// {
// 	int8_t rslt;
// 	uint8_t self_test_bit;

// 	/* Triggers the start of normal self test */
// 	enable_normal_self_test(&self_test_bit);
// 		/* Check for self test completion status */
// 		if (self_test_bit == 0) {
// 			/* Validates the self test results for all 3 axes */
// 			rslt = validate_normal_self_test();
// 		}

